## M-Kopa Data

In [1]:
# let's start by importing libraries we are going to use
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

### Load our data

In [2]:
filepath = 'KOPA.csv'
df = pd.read_csv(filepath,parse_dates=['StartDate'])

### Get an overview of the data

In [3]:
df.head()

,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDays,AmountPaid30,AmountPaid60,AmountPaid360,LoanStatus360
0,Product B,Male,Location 2,Region 2,16600,2014-07-04,2000,40,365,3121,4241,13621,Active
1,Product B,Male,Location 3,Region 3,16600,2015-01-02,2000,40,365,3061,4171,15041,Active
2,Product C,Female,Location 5,Region 5,15600,2012-12-08,1000,40,365,2160,3280,15340,Active
3,Product B,Male,Location 6,Region 1,16600,2015-02-20,2000,40,365,3041,4241,15321,Active
4,Product D,Female,Location 7,Region 2,20250,2013-10-28,2000,50,365,3470,4820,13720,Active

### Lets check the statistics of given dataset

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9195 entries, 0 to 9194
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         9195 non-null   object
 1   CustomerGender  9195 non-null   object
 2   Location        9195 non-null   object
 3   Region          9195 non-null   object
 4   TotalPrice      9195 non-null   int64
 5   StartDate       9195 non-null   datetime64[ns]
 6   Deposit         9195 non-null   int64
 7   DailyRate       9195 non-null   int64
 8   TotalDays       9195 non-null   int64
 9   AmountPaid30    9195 non-null   int64
 10  AmountPaid60    9195 non-null   int64
 11  AmountPaid360   9195 non-null   int64
 12  LoanStatus360   9195 non-null   object
dtypes: datetime64[ns](1), int64(7), object(5)
memory usage: 934.0+ KB

In [5]:
df.describe()

,TotalPrice,Deposit,DailyRate,TotalDays,AmountPaid30,AmountPaid60,AmountPaid360
count,9195.000000,9195.000000,9195.000000,9195.0,9195.000000,9195.000000,9195.000000
mean,19266.264274,2311.528004,46.451332,365.0,3580.482762,4735.672974,14673.833061
std,6053.291677,1412.612091,13.375759,0.0,2487.320211,2756.332798,6676.242654
min,13775.000000,1000.000000,35.000000,365.0,-3200.000000,-3200.000000,-3200.000000
25%,16600.000000,2000.000000,40.000000,365.0,2500.000000,3437.500000,11351.000000
50%,16600.000000,2000.000000,40.000000,365.0,3351.000000,4400.000000,15140.000000
75%,20250.000000,2000.000000,50.000000,365.0,4601.000000,5668.000000,16600.000000
max,69225.000000,9000.000000,165.000000,365.0,26001.000000,33501.000000,69225.000000